app/Controllers/Guru.php

INSERT INTO `guru` (`kode`, `nama`, `email`, `no_telp`, `ampuan`, `alamat`, `created_at`, `updated_at`) VALUES ('asdasd', 'asdasd', 'asdasd@gmail.com', 'asdasd', 'asdasd', 'sadsad', '2023-09-05 06:40:04', '2023-09-05 06:40:04')
---
    public function add()
    {
        $this->guruModel->save([
            'kode' => $this->request->getVar('kode'),
            'nama' => $this->request->getVar('nama'),
            'email' => $this->request->getVar('email'),
            'no_telp' => $this->request->getVar('no_telp'),
            'ampuan' => $this->request->getVar('ampuan'),
            'alamat' => $this->request->getVar('alamat'),
        ]);