app/Models/GuruModel.php

    public function getGuru($kode = false)
    {
        if ($kode == false) {
            return $this->findAll();
---
SELECT *
FROM `guru`